; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	thermograph2 - mode
	image1 - mode
	thermograph0 - mode
	Star4 - direction
	Star1 - direction
	Star0 - direction
	GroundStation2 - direction
	GroundStation3 - direction
	Planet5 - direction
	Star6 - direction
	Star7 - direction
	Star8 - direction
)
(:init
	(supports instrument0 thermograph0)
	(calibration_target instrument0 Star1)
	(supports instrument1 thermograph0)
	(supports instrument1 thermograph2)
	(calibration_target instrument1 Star0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet5)
	(supports instrument2 image1)
	(supports instrument2 thermograph0)
	(supports instrument2 thermograph2)
	(calibration_target instrument2 Star0)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star0)
	(supports instrument3 image1)
	(supports instrument3 thermograph2)
	(supports instrument3 thermograph0)
	(calibration_target instrument3 GroundStation2)
	(supports instrument4 thermograph0)
	(supports instrument4 image1)
	(calibration_target instrument4 GroundStation3)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation2)
)
(:goal (and
	(pointing satellite0 Star4)
	(pointing satellite2 Star0)
	(have_image Planet5 image1)
	(have_image Star6 image1)
	(have_image Star7 thermograph0)
	(have_image Star8 image1)
))

)

; plan
1. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 6
2. (calibrate satellite1 instrument2 star0)
   added: (calibrated instrument2)
   goals met: 0 of 6
3. (turn_to satellite1 star6 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 star6)
   goals met: 0 of 6
4. (take_image satellite1 star6 instrument2 image1)
   added: (have_image star6 image1)
   goals met: 1 of 6
5. (turn_to satellite1 planet5 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 planet5)
   goals met: 1 of 6
6. (turn_to satellite0 star4 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 star4)
   goals met: 2 of 6
7. (take_image satellite1 planet5 instrument2 image1)
   added: (have_image planet5 image1)
   goals met: 3 of 6
8. (turn_to satellite1 star7 planet5)
   deleted: (pointing satellite1 planet5)
   added: (pointing satellite1 star7)
   goals met: 3 of 6
9. (take_image satellite1 star7 instrument2 thermograph0)
   added: (have_image star7 thermograph0)
   goals met: 4 of 6
10. (turn_to satellite1 star8 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 star8)
   goals met: 4 of 6
11. (take_image satellite1 star8 instrument2 image1)
   added: (have_image star8 image1)
   goals met: 5 of 6
12. (turn_to satellite2 star0 groundstation2)
   deleted: (pointing satellite2 groundstation2)
   added: (pointing satellite2 star0)
   goals met: 6 of 6
